Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_15 (Conv2D)           (None, 128, 128, 8)       224       
_________________________________________________________________
batch_normalization_15 (Batc (None, 128, 128, 8)       32        
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 64, 64, 8)         0         
_________________________________________________________________
dropout_21 (Dropout)         (None, 64, 64, 8)         0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 64, 64, 16)        1168      
_________________________________________________________________
batch_normalization_16 (Batc (None, 64, 64, 16)        64        
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_22 (Dropout)         (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 32, 32, 32)        4640      
_________________________________________________________________
batch_normalization_17 (Batc (None, 32, 32, 32)        128       
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_23 (Dropout)         (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 16, 16, 64)        18496     
_________________________________________________________________
batch_normalization_18 (Batc (None, 16, 16, 64)        256       
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 8, 8, 64)          0         
_________________________________________________________________
dropout_24 (Dropout)         (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 8, 8, 128)         73856     
_________________________________________________________________
batch_normalization_19 (Batc (None, 8, 8, 128)         512       
_________________________________________________________________
max_pooling2d_19 (MaxPooling (None, 2, 2, 128)         0         
_________________________________________________________________
dropout_25 (Dropout)         (None, 2, 2, 128)         0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 512)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 256)               131328    
_________________________________________________________________
dropout_26 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 512)               131584    
_________________________________________________________________
dropout_27 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 14)                7182      
=================================================================
Total params: 369,470
Trainable params: 368,974
Non-trainable params: 496
_________________________________________________________________
