Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_20 (Conv2D)           (None, 224, 224, 8)       224       
_________________________________________________________________
batch_normalization_20 (Batc (None, 224, 224, 8)       32        
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 112, 112, 8)       0         
_________________________________________________________________
dropout_24 (Dropout)         (None, 112, 112, 8)       0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 112, 112, 16)      1168      
_________________________________________________________________
batch_normalization_21 (Batc (None, 112, 112, 16)      64        
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 56, 56, 16)        0         
_________________________________________________________________
dropout_25 (Dropout)         (None, 56, 56, 16)        0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 56, 56, 32)        4640      
_________________________________________________________________
batch_normalization_22 (Batc (None, 56, 56, 32)        128       
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 28, 28, 32)        0         
_________________________________________________________________
dropout_26 (Dropout)         (None, 28, 28, 32)        0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 28, 28, 64)        18496     
_________________________________________________________________
batch_normalization_23 (Batc (None, 28, 28, 64)        256       
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 14, 14, 64)        0         
_________________________________________________________________
dropout_27 (Dropout)         (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 14, 14, 128)       73856     
_________________________________________________________________
batch_normalization_24 (Batc (None, 14, 14, 128)       512       
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 4, 4, 128)         0         
_________________________________________________________________
dropout_28 (Dropout)         (None, 4, 4, 128)         0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 2048)              0         
_________________________________________________________________
dense_8 (Dense)              (None, 256)               524544    
_________________________________________________________________
dropout_29 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 14)                3598      
=================================================================
Total params: 627,518
Trainable params: 627,022
Non-trainable params: 496
_________________________________________________________________
