Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
mobilenet_1.00_128 (Model)   (None, 1024)              3228864   
_________________________________________________________________
dropout (Dropout)            (None, 1024)              0         
_________________________________________________________________
dense (Dense)                (None, 512)               524800    
_________________________________________________________________
dropout_1 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 14)                7182      
=================================================================
Total params: 3,760,846
Trainable params: 3,738,958
Non-trainable params: 21,888
_________________________________________________________________
